name_theme = "Циклы (в разработке)"
questions_dict = {
    51: {
        "question": "Какой результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[2])'?",
        "answer_1": "0",
        "answer_2": "1",
        "answer_3": "2",
        "answer_4": "3",
        "answer_5": "4",
        "valid": "answer_3",
        "explanation": "Индексация в списках начинается с 0, поэтому элемент с индексом 2 равен 2."
    },
    52: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[-1])'?",
        "answer_1": "4",
        "answer_2": "3",
        "answer_3": "2",
        "answer_4": "1",
        "answer_5": "0",
        "valid": "answer_1",
        "explanation": "Отрицательная индексация позволяет получить элементы с конца списка, поэтому -1 соответствует последнему элементу."
    },
    53: {
        "question": "Какой результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[1:4])'?",
        "answer_1": "[1, 2, 3]",
        "answer_2": "[0, 1, 2, 3]",
        "answer_3": "[1, 2, 3, 4]",
        "answer_4": "[1, 2, 3, 4, 5]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[1:4] возвращает элементы с индексами 1, 2 и 3, поэтому результат будет [1, 2, 3]."
    },
    54: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[:3])'?",
        "answer_1": "[0, 1, 2]",
        "answer_2": "[0, 1, 2, 3]",
        "answer_3": "[1, 2, 3]",
        "answer_4": "[0, 1]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[:3] возвращает элементы с индексами 0, 1 и 2, то есть [0, 1, 2]."
    },
    55: {
        "question": "Какой результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[::2])'?",
        "answer_1": "[0, 1, 2, 3, 4]",
        "answer_2": "[0, 2, 4]",
        "answer_3": "[1, 3]",
        "answer_4": "[0, 1, 2]",
        "answer_5": "Ошибка",
        "valid": "answer_2",
        "explanation": "Срез my_list[::2] возвращает каждый второй элемент, начиная с 0, то есть [0, 2, 4]."
    },
    56: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[1:4:2])'?",
        "answer_1": "[1, 2]",
        "answer_2": "[1, 3]",
        "answer_3": "[0, 2, 4]",
        "answer_4": "[1, 2, 3]",
        "answer_5": "Ошибка",
        "valid": "answer_2",
        "explanation": "Срез my_list[1:4:2] возвращает элементы с индексами 1 и 3, то есть [1, 3]."
    },
    57: {
        "question": "Какой результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[-3:])'?",
        "answer_1": "[2, 3, 4]",
        "answer_2": "[1, 2, 3, 4]",
        "answer_3": "[0, 1, 2]",
        "answer_4": "[0, 1]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[-3:] возвращает последние три элемента списка, то есть [2, 3, 4]."
    },
    58: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(5)))'?",
        "answer_1": "[0, 1, 2, 3, 4]",
        "answer_2": "[1, 2, 3, 4, 5]",
        "answer_3": "[0, 1, 2, 3, 4, 5]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Функция range(5) генерирует числа от 0 до 4, и преобразование в список даст [0, 1, 2, 3, 4]."
    },
    59: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(1, 10, 2)))'?",
        "answer_1": "[1, 2, 3, 4, 5, 6, 7, 8, 9]",
        "answer_2": "[1, 3, 5, 7, 9]",
        "answer_3": "[2, 4, 6, 8]",
        "answer_4": "[1, 2, 3, 4, 5]",
        "answer_5": "Ошибка",
        "valid": "answer_2",
        "explanation": "Функция range(1, 10, 2) генерирует нечетные числа от 1 до 9, то есть [1, 3, 5, 7, 9]."
    },
    60: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(5, 0, -1)))'?",
        "answer_1": "[5, 4, 3, 2, 1]",
        "answer_2": "[5, 4, 3, 2, 0]",
        "answer_3": "[1, 2, 3, 4, 5]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Функция range(5, 0, -1) генерирует числа от 5 до 1 в обратном порядке, то есть [5, 4, 3, 2, 1]."
    },
    61: {
        "question": "Какой результат выполнения следующего кода: 'my_list = [1, 2, 3]; print(my_list[0:2])'?",
        "answer_1": "[1, 2]",
        "answer_2": "[1, 2, 3]",
        "answer_3": "[2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Срез my_list[0:2] возвращает элементы с индексами 0 и 1, то есть [1, 2]."
    },
    62: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; my_list[1:2] = [4, 5]; print(my_list)'?",
        "answer_1": "[1, 4, 5, 3]",
        "answer_2": "[1, 2, 4, 5, 3]",
        "answer_3": "[4, 5, 3]",
        "answer_4": "[1, 2, 3, 4, 5]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[1:2] заменяется на [4, 5], поэтому результатом будет [1, 4, 5, 3]."
    },
    63: {
        "question": "Какой будет результат выполнения следующего кода: 'my_tuple = (1, 2, 3); print(my_tuple[1:])'?",
        "answer_1": "(2, 3)",
        "answer_2": "(1, 2, 3)",
        "answer_3": "(1,)",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Срез my_tuple[1:] возвращает элементы с индексами 1 и 2, то есть (2, 3)."
    },
    64: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(2, 10, 2)))'?",
        "answer_1": "[2, 4, 6, 8]",
        "answer_2": "[0, 2, 4, 6, 8]",
        "answer_3": "[1, 3, 5, 7, 9]",
        "answer_4": "[2, 3, 4, 5, 6, 7, 8, 9]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Функция range(2, 10, 2) генерирует четные числа от 2 до 8, то есть [2, 4, 6, 8]."
    },
    65: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(5, 15, 3)))'?",
        "answer_1": "[5, 8, 11, 14]",
        "answer_2": "[5, 6, 7, 8, 9, 10, 11, 12, 13, 14]",
        "answer_3": "[5, 6, 7, 8, 9, 10, 11, 12, 13]",
        "answer_4": "[5, 8, 11, 12, 14]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Функция range(5, 15, 3) генерирует числа от 5 до 14 с шагом 3, то есть [5, 8, 11, 14]."
    },
    66: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; print(my_list[::2])'?",
        "answer_1": "[1, 2, 3]",
        "answer_2": "[1, 3]",
        "answer_3": "[2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_2",
        "explanation": "Срез my_list[::2] возвращает каждый второй элемент, начиная с 1, то есть [1, 3]."
    },
    67: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3, 4]; print(my_list[-2:])'?",
        "answer_1": "[3, 4]",
        "answer_2": "[4]",
        "answer_3": "[1, 2]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Срез my_list[-2:] возвращает последние два элемента, то есть [3, 4]."
    },
    68: {
        "question": "Какой будет результат выполнения следующего кода: 'print(my_list[1:3])' для my_list = [1, 2, 3, 4]?",
        "answer_1": "[2, 3]",
        "answer_2": "[1, 2, 3]",
        "answer_3": "[1, 2]",
        "answer_4": "[2, 3, 4]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[1:3] возвращает элементыс индексами 1 и 2, то есть [2, 3]."
    },
    69: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [0, 1, 2, 3]; print(my_list[::-1])'?",
        "answer_1": "[3, 2, 1, 0]",
        "answer_2": "[0, 1, 2, 3]",
        "answer_3": "[1, 2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Срез my_list[::-1] возвращает элементы в обратном порядке, то есть [3, 2, 1, 0]."
    },
    70: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(10, 0, -2)))'?",
        "answer_1": "[10, 8, 6, 4, 2]",
        "answer_2": "[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]",
        "answer_3": "[10, 9, 8, 7, 6]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Функция range(10, 0, -2) генерирует числа от 10 до 2 с шагом -2, то есть [10, 8, 6, 4, 2]."
    },
    71: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[1:-1])'?",
        "answer_1": "[1, 2, 3]",
        "answer_2": "[0, 1, 2, 3]",
        "answer_3": "[1, 2, 3, 4]",
        "answer_4": "[0, 1]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[1:-1] возвращает элементы с индексами 1, 2 и 3, то есть [1, 2, 3]."
    },
    72: {
        "question": "Какой будет результат выполнения следующего кода: 'for i in range(3, 10, 3): print(i)'?",
        "answer_1": "3, 6, 9",
        "answer_2": "3, 6",
        "answer_3": "3, 4, 5, 6, 7, 8, 9",
        "answer_4": "3, 4, 5, 6, 7, 8",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Функция range(3, 10, 3) генерирует числа 3, 6, 9."
    },
    73: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; print(my_list[:])'?",
        "answer_1": "[1, 2, 3]",
        "answer_2": "[1, 2]",
        "answer_3": "[2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Срез my_list[:] возвращает все элементы списка, то есть [1, 2, 3]."
    },
    74: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(0, 10, 5)))'?",
        "answer_1": "[0, 5]",
        "answer_2": "[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]",
        "answer_3": "[0, 5, 10]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Функция range(0, 10, 5) генерирует числа от 0 до 5, то есть [0, 5]."
    },
    75: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; my_list[0] = 4; print(my_list)'?",
        "answer_1": "[4, 2, 3]",
        "answer_2": "[1, 2, 3]",
        "answer_3": "[0, 1, 2]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Элемент с индексом 0 заменяется на 4, поэтому результатом будет [4, 2, 3]."
    },
    76: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[2:])'?",
        "answer_1": "[2, 3, 4]",
        "answer_2": "[0, 1, 2]",
        "answer_3": "[1, 2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Срез my_list[2:] возвращает элементы с индексами от 2 до конца списка, то есть [2, 3, 4]."
    },
    77: {
        "question": "Какой результат выполнения следующего кода: 'print(list(range(1, 5)))'?",
        "answer_1": "[1, 2, 3, 4]",
        "answer_2": "[1, 2, 3, 4, 5]",
        "answer_3": "[0, 1, 2, 3, 4]",
        "answer_4": "[1, 2]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Функция range(1, 5) генерирует числа от 1 до 4, и преобразование в список даст [1, 2, 3, 4]."
    },
    78: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(5, 15, 5)))'?",
        "answer1": "[5, 10, 15]",
        "answer2": "5, 10",
        "answer3": "[5, 6, 7, 8, 9, 10, 11, 12, 13, 14]",
        "answer4": "5, 6, 7, 8, 9, 10, 11, 12, 13",
        "answer5": "Ошибка",
        "valid": "answer2",
        "explanation": "Функция range(5, 15, 5) генерирует числа от 5 до 10 с шагом 5, то есть 5, 10."
    },
    79: {
        "question": "Какой будет результат выполнения следующего кода: 'mylist = [1, 2]; mylist.append(3); print(mylist)'?",
        "answer1": "1, 2, 3",
        "answer2": "[1, 2]",
        "answer3": "3, 1, 2",
        "answer4": "Ошибка",
        "answer5": "None",
        "valid": "answer1",
        "explanation": "Метод append() добавляет элемент в конец списка, поэтому результатом будет [1, 2, 3]."
    },
    80: {
        "question": "Какой будет результат выполнения следующего кода: 'mylist = 1, 2, 3; mylist[1:2] = [4, 5]; print(mylist)'?",
        "answer1": "[1, 4, 5, 3]",
        "answer2": "1, 2, 4, 5, 3",
        "answer3": "[4, 5, 3]",
        "answer4": "1, 2, 3, 4, 5",
        "answer5": "Ошибка",
        "valid": "answer1",
        "explanation": "Срез mylist[1:2] заменяется на [4, 5], поэтому результатом будет [1, 4, 5, 3]."
    },
    81: {
        "question": "Какой будет результат выполнения следующего кода: 'for i in range(5): if i == 4: break; print(i)'?",
        "answer1": "0, 1, 2, 3",
        "answer2": "0, 1, 2, 3, 4",
        "answer3": "0, 1, 2, 3, 5",
        "answer4": "Ошибка",
        "answer5": "None",
        "valid": "answer1",
        "explanation": "Цикл завершится, когда i станет равным 4, поэтому будут выведены только 0, 1, 2, 3."
    },
    82: {
        "question": "Какой будет результат выполнения следующего кода: 'mylist = 1, 2, 3; mylist[1] = 4; print(mylist)'?",
        "answer1": "[1, 4, 3]",
        "answer2": "1, 2, 3",
        "answer3": "[4, 2, 3]",
        "answer4": "Ошибка",
        "answer5": "None",
        "valid": "answer1",
        "explanation": "Элемент с индексом 1 заменяется на 4, поэтому результатом будет 1, 4, 3."
    },
    83: {
        "question": "Какой будет результат выполнения следующего кода: 'mylist = [0, 1, 2, 3, 4]; print(mylist::2)'?",
        "answer1": "[0, 2, 4]",
        "answer2": "1, 3",
        "answer3": "[0, 1, 2, 3, 4]",
        "answer4": "0, 1, 2, 3",
        "answer5": "Ошибка",
        "valid": "answer1",
        "explanation": "Срез mylist[::2] возвращает каждый второй элемент, начиная с 0, то есть [0, 2, 4]."
    },
    84: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(1, 5)))'?",
        "answer1": "1, 2, 3, 4",
        "answer2": "[1, 2, 3, 4, 5]",
        "answer3": "0, 1, 2, 3, 4",
        "answer4": "[1, 2]",
        "answer5": "Ошибка",
        "valid": "answer1",
        "explanation": "Функция range(1, 5) генерирует числа от 1 до 4, и преобразование в список даст [1, 2, 3, 4]."
    },
    85: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(10, 0, -2)))'?",
        "answer1": "10, 8, 6, 4, 2",
        "answer2": "[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]",
        "answer3": "10, 9, 8, 7, 6",
        "answer4": "Ошибка",
        "answer5": "None",
        "valid": "answer1",
        "explanation": "Функция range(10, 0, -2) генерирует числа от 10 до 2 с шагом -2, то есть [10, 8, 6, 4, 2]."
    },
    86: {
        "question": "Какой будет результат выполнения следующего кода: 'mylist = 1, 2, 3; mylist.insert(1, 4); print(mylist)'?",
        "answer1": "[1, 4, 2, 3]",
        "answer2": "1, 2, 4, 3",
        "answer3": "[4, 1, 2, 3]",
        "answer4": "1, 2, 3, 4",
        "answer5": "Ошибка",
        "valid": "answer1",
        "explanation": "Метод insert() добавляет элемент 4 на индекс 1, сдвигая остальныеэлементы вправо."
    },
    87: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; my_list.extend([4, 5]); print(my_list)'?",
        "answer_1": "[1, 2, 3, 4, 5]",
        "answer_2": "[1, 2, 3]",
        "answer_3": "[4, 5, 1, 2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Метод extend() добавляет элементы из другого списка в конец, поэтому результатом будет [1, 2, 3, 4, 5]."
    },
    88: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; print(my_list[-2:-1])'?",
        "answer_1": "[2]",
        "answer_2": "[1, 2]",
        "answer_3": "[1]",
        "answer_4": "[2, 3]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[-2:-1] возвращает элементы с индексами -2 до -1, то есть [2]."
    },
    89: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [0, 1, 2, 3, 4]; print(my_list[::3])'?",
        "answer_1": "[0, 3]",
        "answer_2": "[1, 2, 3]",
        "answer_3": "[0, 1, 2, 3, 4]",
        "answer_4": "[0, 1, 2]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[::3] возвращает каждый третий элемент, начиная с 0, то есть [0, 3]."
    },
    90: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(5, 15, 5)))'?",
        "answer_1": "[5, 10, 15]",
        "answer_2": "[5, 10]",
        "answer_3": "[5, 6, 7, 8, 9, 10, 11, 12, 13, 14]",
        "answer_4": "[5, 6, 7, 8, 9, 10, 11, 12, 13]",
        "answer_5": "Ошибка",
        "valid": "answer_2",
        "explanation": "Функция range(5, 15, 5) генерирует числа от 5 до 10 с шагом 5, то есть [5, 10]."
    },
    91: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; my_list += [4, 5]; print(my_list)'?",
        "answer_1": "[1, 2, 3, 4, 5]",
        "answer_2": "[1, 2, 3]",
        "answer_3": "[4, 5, 1, 2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Оператор += добавляет элементы из другого списка, поэтому результатом будет [1, 2, 3, 4, 5]."
    },
    92: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; my_list.pop(1); print(my_list)'?",
        "answer_1": "[1, 3]",
        "answer_2": "[2, 3]",
        "answer_3": "[1, 2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Метод pop(1) удаляет элемент с индексом 1, который равен 2, и возвращает [1, 3]."
    },
    93: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; del my_list[1]; print(my_list)'?",
        "answer_1": "[1, 3]",
        "answer_2": "[2, 3]",
        "answer_3": "[1, 2, 3]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Оператор del удаляет элемент с индексом 1, поэтому результатом будет [1, 3]."
    },
    94: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; print(my_list[1:])'?",
        "answer_1": "[2, 3]",
        "answer_2": "[1, 2, 3]",
        "answer_3": "[1, 2]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Срез my_list[1:] возвращает элементы с индексами от 1 до конца списка, то есть [2, 3]."
    },
    95: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(10, -1, -2)))'?",
        "answer_1": "[10, 8, 6, 4, 2, 0]",
        "answer_2": "[10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0]",
        "answer_3": "[10, 8, 6, 4, 2]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Функция range(10, -1, -2) генерирует числа от 10 до 0 с шагом -2, то есть [10, 8, 6, 4, 2, 0]."
    },
    96: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(5, 0, -1)))'?",
        "answer_1": "[5, 4, 3, 2, 1]",
        "answer_2": "[5, 4, 3, 2, 0]",
        "answer_3": "[1, 2, 3, 4, 5]",
        "answer_4": "Ошибка",
        "answer_5": "None",
        "valid": "answer_1",
        "explanation": "Функция range(5, 0, -1) генерирует числа от 5 до 1 в обратном порядке, то есть [5, 4, 3, 2, 1]."
    },
    97: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; print(my_list[1:2])'?",
        "answer_1": "[2]",
        "answer_2": "[1, 2]",
        "answer_3": "[1]",
        "answer_4": "[2, 3]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[1:2] возвращает элементы с индексами 1 до 2, то есть [2]."
    },
    98: {
        "question": "Какой будет результат выполнения следующего кода: 'print(list(range(0, 10, 2)))'?",
        "answer_1": "[0, 2, 4, 6, 8]",
        "answer_2": "[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]",
        "answer_3": "[1, 3, 5, 7, 9]",
        "answer_4": "[0, 1, 2, 3]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Функция range(0, 10, 2) генерирует четные числа от 0 до 8, то есть [0, 2, 4, 6, 8]."
    },
    99: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3]; my_list[0:2] = [4, 5]; print(my_list)'?",
        "answer_1": "[4, 5, 3]",
        "answer_2": "[1, 2, 4, 5, 3]",
        "answer_3": "[4, 5, 3]",
        "answer_4": "[1, 2, 3, 4, 5]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[0:2] заменяется на [4, 5], поэтому результатом будет [4, 5, 3]."
    },
    100: {
        "question": "Какой будет результат выполнения следующего кода: 'my_list = [1, 2, 3, 4, 5]; print(my_list[-1:-3:-1])'?",
        "answer_1": "[5, 4]",
        "answer_2": "[5, 4, 3]",
        "answer_3": "[5, 4, 3, 2]",
        "answer_4": "[5, 4, 3, 2, 1]",
        "answer_5": "Ошибка",
        "valid": "answer_1",
        "explanation": "Срез my_list[-1:-3:-1] возвращает элементы с конца списка в обратном порядке, то есть [5, 4]."
    },

}